  {
    "details": [ 
       { 
        "id":"01", 
        "name": "Mziyanda", 
        "lastname": "Joko", 
        "address": "Y512 Sani Crescent", 
        "email": "joko.mzee@gmail.com",
        "phone": "062 420 4382",
        "role": "Web Developer",
        "bio": "Hi, my name is Mziyanda Joko but you can call me Joko My passion for coding began during high school, since then I was sold and wanted to know more and the journey never stopped ever since. I am also a sports person and play Cricket on weekends when I am not coding something on the side",
        "linkedIn": "https://www.linkedin.com/in/mziyanda-joko-72b40b134/",
        "Github": "https://github.com/mziyandajoko",
        "website": "http://mziyandajoko.co.za/"
     }  
   ],
   "workesperience": [ 
      {
         "id":"01", 
        "company": "EastEndYovth", 
        "link": "https://superseedstudio.com/", 
        "address": "Cape Town, Unit 1A, 31 Bell Crescent, Westlake Business Park, Westlake Cape Town",
        "tell": "+27 021 788 3255",
        "role":"Front Developer",
        "start_date":"Feb 2021 - Nov 2021",
        "description":[
         "Collaborated with designers and project managers to create and customize WordPress websites for clients in various industries – Food and Beverages, FMCG, Hospitality",
         "Developed custom WordPress themes and plugins using HTML, CSS, JavaScript",
         "Managed website updates and maintenance, ensuring all plugins and themes were up- to-date and functioning properly",
         "Optimized website speed and performance, including image optimization and caching - SEO",
         "Utilized Google Analytics and other tools to monitor website traffic and identify areas for improvement",
         "Implemented SEO best practices, including keyword research and on-page optimization, HTML, JavaScript, SCSS, Elementor, child themes, Elementor new Containers"
        ],
        "tools": "WordPress, Elementor editor and other plugins for different purposes like toolset for dynamic content" 
      },
      {
         "id":"02", 
        "company": "Superseedstudio", 
        "link": "https://superseedstudio.com/", 
        "address": "Cape Town, Unit 1A, 31 Bell Crescent, Westlake Business Park, Westlake Cape Town",
        "tell": "+27 021 788 3255",
        "role":" Front Developer",
        "start_date":"Feb 2021 - Nov 2021",
        "description":[
         "Collaborated with cross-functional teams to design and develop WordPress websites for clients in the healthcare industry",
         "Customized existing WordPress themes and plugins to meet client requirements",
         "Implemented website security measures, including SSL certificates and firewalls",
         "Conducted testing and debugging to ensure website features and plugins were functioning properly across all devices and browsers",
         "Assisted with website content management",
         "JavaScript, CSS, Elementor, child themes, Custom toolset"
         
        ],
        "tools": "WordPress, Elementor editor and other plugins for different purposes like toolset for dynamic content" 
      },
      {
         "id":"03", 
         "company": "Culture Systems",
         "address": "Observatory, Cape Town",
         "tell": "082 082 7179",
         "role": "Flutter/Web Developer",
         "start_date": "Mar 2019 - Feb 2020",
         "description": [
            "Worked as a freelancer developer for more than two projects – Yoga App, an exercise and habit tracker built with Flutter and Finlight, and investment management static website using Bootstrap, Jquery, CSS",
            "Responsible for creating front-end services for web development and hybrid app development.",
            "Designed, developed, and implemented software applications for website based on analyzed requirements and understanding of industry technical standards."
           
         ],
         "tools": "HTML, JavaScript, Less, Flutter framework, Dart, Trello boards, Bitbucket and Jira."
      },
      {
         "id":"04", 
         "company": "Blank Tech",
         "link":"https://blanktech.co.za/",
         "address": "129 Main Rd, Observatory, Cape Town, 7935",
         "tell": "067 648 6553",
         "start_date": "Jul 2020 - Nov 2020",
         "role": "Flutter Developer",
         "description": [
            "Developing Ayaamah beauty App with Flutter and dart – Scheduling for neighborhood barbershops and salons",
            "Responsible for dev work and releasing new features and distributing the app for user reviews and bug fixing for different platforms",
            "Login and Authentication, Frontend Navigation for Homepage and Profile Page features" 
         ],
         "tools": "Flutter framework, Dart, Gitlab, Trello boards"
      },
      {
         "id":"05", 
         "company": "VMLY&R CAPE TOWN",
         "link":"https://www.vmlyr.com/",
         "address": "G12 Old Castle Brewery Complex 6 Beach Road Woodstock, 7925 South Africa",
         "tell": "+27.021.434.4375",
         "start_date": "Feb 2017 - Apr 2018",
         "role": "Front Developer",
         "description": [
            "Worked as an intern web developer under the big client they had at the time Old Mutual",
            "Responsible for developing new features on the internal service they using and testing for functionality and bug fixing"
         ],
         "tools": "HTML, Bootstrap, JavaScript, Less, Nunjucks Framework, Dust Framework and Github."
      }
   ],
   "courses":[
      {
         "id":"05", 
         "courseName": "Web developer",
         "company": "CodeSpace",
         "start_date": "2016-07 - 2016-12",
         "skills":"Skills acquired: HTML, CSS, jQuery, PHP, MySQL",
         "link": "https://www.codespace.co.za/"
      },
      {
         "id":"02", 
         "courseName": "Flutter",
         "company": "App Brewery",
         "skills": "Flutter, Dart",
         "start_date": "2019-10 - 2019-11",
         "link": "https://www.appbrewery.co/"      
      },
      {
         "id":"03", 
         "courseName": "Yes 4 Youth Digital skills",
         "company": "Capaciti",
         "skills":"Digital Marketing and SEO",
         "start_date":"2020-02 - 2020-12",
         "discription":"",
         "link": "https://www.citi.org.za/"
      },
      {
         "id":"04", 
         "courseName":"AWS Architecture",
         "company": "Devier",
         "start_date": "Nov 2020 - Jan 2021",
         "skills":"AWS cloud Architecture, Python, Dynamo DB.",
         "link": "https://recruitment.deviare.co.za/"
      },
      {
         "id":"05", 
         "courseName": "Advanced web development",
         "company": "Scrimba",
         "skills": "React,Vue, Flex-box, CSS-grid, javascript",
         "start_date": "continuous learning",
         "link": "https://scrimba.com/allcourses"
      }
   ],
   "skills":[ {
    "skillsList": "HTML, Javascript, WordPress, React, CSS, JAMstack, NUNJUCKS, FLUTTER, Git, Nodejs, Eleventy, Express.js, Bitbucket, Dust, Jira, AWS cloud Architecture" 
   }
]
}
